RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_cam.c
/**
  ******************************************************************************
  * @file    bl808_cam.c
  * @version V1.0
  * @date
  * @brief   This file is the standard driver c file
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

#include "bl808.h"
#include "bl808_cam.h"
#include "bl808_glb.h"

/** @addtogroup  BL808_Peripheral_Driver
 *  @{
 */

/** @addtogroup  CAM
 *  @{
 */

/** @defgroup  CAM_Private_Macros
 *  @{
 */

/*@} end of group CAM_Private_Macros */

/** @defgroup  CAM_Private_Types
 *  @{
 */

/*@} end of group CAM_Private_Types */

/** @defgroup  CAM_Private_Variables
 *  @{
 */
static const uint32_t camAddr[CAM_ID_MAX] = { DVP0_BASE, DVP1_BASE, DVP2_BASE, DVP3_BASE,
                                              DVP4_BASE, DVP5_BASE, DVP6_BASE, DVP7_BASE };
#ifndef BFLB_USE_HAL_DRIVER
static intCallback_Type *camIntCbfArra[CAM_ID_MAX][CAM_INT_ALL] = { { NULL } };
#endif

/*@} end of group CAM_Private_Variables */

/** @defgroup  CAM_Global_Variables
 *  @{
 */

/*@} end of group CAM_Global_Variables */

/** @defgroup  CAM_Private_Fun_Declaration
 *  @{
 */
#ifndef BFLB_USE_HAL_DRIVER
static void CAM_IntHandler(CAM_ID_Type camId);
#endif

/*@} end of group CAM_Private_Fun_Declaration */

/** @defgroup  CAM_Private_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  Camera interrupt common handler function
 *
 * @param  camId: Camera ID type
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
static void CAM_IntHandler(CAM_ID_Type camId)
{
    uint32_t tmpVal;
    uint32_t CAMx = camAddr[camId];

    /* Check the parameters */
    CHECK_PARAM(IS_CAM_ID_TYPE(camId));

    tmpVal = BL_RD_REG(CAMx, CAM_DVP_STATUS_AND_ERROR);

    if (BL_IS_REG_BIT_SET(tmpVal, CAM_STS_NORMAL_INT)) {
        CAM_IntClr(camId, CAM_INT_NORMAL);

        if (camIntCbfArra[camId][CAM_INT_NORMAL] != NULL) {
            /* call the callback function */
            camIntCbfArra[camId][CAM_INT_NORMAL]();
        }
    }

    if (BL_IS_REG_BIT_SET(tmpVal, CAM_STS_MEM_INT)) {
        CAM_IntClr(camId, CAM_INT_MEMORY_OVERWRITE);

        if (camIntCbfArra[camId][CAM_INT_MEMORY_OVERWRITE] != NULL) {
            /* call the callback function */
            camIntCbfArra[camId][CAM_INT_MEMORY_OVERWRITE]();
        }
    }

    if (BL_IS_REG_BIT_SET(tmpVal, CAM_STS_FRAME_INT)) {
        CAM_IntClr(camId, CAM_INT_FRAME_OVERWRITE);

        if (camIntCbfArra[camId][CAM_INT_FRAME_OVERWRITE] != NULL) {
            /* call the callback function */
            camIntCbfArra[camId][CAM_INT_FRAME_OVERWRITE]();
        }
    }

    if (BL_IS_REG_BIT_SET(tmpVal, CAM_STS_FIFO_INT)) {
        CAM_IntClr(camId, CAM_INT_FIFO_OVERWRITE);

        if (camIntCbfArra[camId][CAM_INT_FIFO_OVERWRITE] != NULL) {
            /* call the callback function */
            camIntCbfArra[camId][CAM_INT_FIFO_OVERWRITE]();
        }
    }

    if (BL_IS_REG_BIT_SET(tmpVal, CAM_STS_HCNT_INT)) {
        CAM_IntClr(camId, CAM_INT_HSYNC_CNT_ERROR);

        if (camIntCbfArra[camId][CAM_INT_HSYNC_CNT_ERROR] != NULL) {
            /* call the callback function */
            camIntCbfArra[camId][CAM_INT_HSYNC_CNT_ERROR]();
        }
    }

    if (BL_IS_REG_BIT_SET(tmpVal, CAM_STS_VCNT_INT)) {
        CAM_IntClr(camId, CAM_INT_VSYNC_CNT_ERROR);

        if (camIntCbfArra[camId][CAM_INT_VSYNC_CNT_ERROR] != NULL) {
            /* call the callback function */
            camIntCbfArra[camId][CAM_INT_VSYNC_CNT_ERROR]();
        }
    }
}
#endif

/*@} end of group CAM_Private_Functions */

/** @defgroup  CAM_Public_Functions
 *  @{
 */

/****************************************************************************/ /**
 * @brief  Camera module init
 *
 * @param  camId: CAM ID type
 * @param  cfg: Camera configuration structure pointer
 *
 * @return None
 *
*******************************************************************************/
void CAM_Init(CAM_ID_Type camId, CAM_CFG_Type *cfg)
{
    uint32_t tmpVal;
    uint32_t CAMx = camAddr[camId];

    /* Check the parameters */
    CHECK_PARAM(IS_CAM_ID_TYPE(camId));
    CHECK_PARAM(IS_CAM_SW_MODE_TYPE(cfg->swMode));
    CHECK_PARAM(IS_CAM_INPUT_PIX_WIDTH_TYPE(cfg->pixWidth));
    CHECK_PARAM(IS_CAM_OUTPUT_DROP_MODE_TYPE(cfg->dropMode));
    CHECK_PARAM(IS_CAM_FRAME_ACTIVE_POL(cfg->framePol));
    CHECK_PARAM(IS_CAM_LINE_ACTIVE_POL(cfg->linePol));
    CHECK_PARAM(IS_CAM_BURST_TYPE(cfg->burstType));
    CHECK_PARAM(IS_CAM_SENSOR_MODE_TYPE(cfg->camSensorMode));

