RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_cam.c
    /* Disable clock gate */
    GLB_PER_Clock_UnGate(GLB_AHB_CLOCK_CAM);

    /* Set camera configuration */
    tmpVal = BL_RD_REG(CAMx, CAM_DVP2AXI_CONFIGUE);
    tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_DVP_ENABLE);
    BL_WR_REG(CAMx, CAM_DVP2AXI_CONFIGUE, tmpVal);

    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_SW_MODE, cfg->swMode);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_DVP_DATA_MODE, cfg->pixWidth);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_FRAM_VLD_POL, cfg->framePol);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_LINE_VLD_POL, cfg->linePol);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_XLEN, cfg->burstType);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_DVP_MODE, cfg->camSensorMode);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_DVP_WAIT_CYCLE, cfg->waitCount);

    switch (cfg->dropMode) {
        case CAM_DROP_NONE:
            tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_DROP_EN);
            tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_V_SUBSAMPLE_EN);
            break;

        case CAM_DROP_ODD_ROW_ODD_PIXEL:
            tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_DROP_EN);
            tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_V_SUBSAMPLE_EN);
            tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_V_SUBSAMPLE_POL);
            break;

        case CAM_DROP_ODD_ROW_EVEN_PIXEL:
            tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_DROP_EN);
            tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_V_SUBSAMPLE_EN);
            tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_V_SUBSAMPLE_POL);
            break;

        case CAM_DROP_ALL_ODD_PIXEL:
            tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_DROP_EN);
            tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_DROP_EVEN);
            tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_V_SUBSAMPLE_EN);
            break;

        case CAM_DROP_ALL_EVEN_PIXEL:
            tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_DROP_EN);
            tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_DROP_EVEN);
            tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_V_SUBSAMPLE_EN);
            break;

        default:
            break;
    }

    BL_WR_REG(CAMx, CAM_DVP2AXI_CONFIGUE, tmpVal);

    /* Set frame count to issue interrupt at sw mode */
    tmpVal = BL_RD_REG(CAMx, CAM_DVP_STATUS_AND_ERROR);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_FRAME_CNT_TRGR_INT, cfg->swIntCnt);
    BL_WR_REG(CAMx, CAM_DVP_STATUS_AND_ERROR, tmpVal);

    /* Set camera memory start address, memory brust size and frame byte size */
    BL_WR_REG(CAMx, CAM_DVP2AXI_ADDR_START, cfg->memStart & 0xFFFFFFF0);

    switch (cfg->burstType) {
        case CAM_BURST_TYPE_SINGLE:
            tmpVal = cfg->memSize / 8;
            break;

        case CAM_BURST_TYPE_INCR4:
            tmpVal = cfg->memSize / 32;
            break;

        case CAM_BURST_TYPE_INCR8:
            tmpVal = cfg->memSize / 64;
            break;

        case CAM_BURST_TYPE_INCR16:
            tmpVal = cfg->memSize / 128;
            break;

        case CAM_BURST_TYPE_INCR32:
            tmpVal = cfg->memSize / 256;
            break;

        case CAM_BURST_TYPE_INCR64:
            tmpVal = cfg->memSize / 512;
            break;

        default:
            tmpVal = 0;
            break;
    }

    BL_WR_REG(CAMx, CAM_DVP2AXI_MEM_BCNT, tmpVal);

    BL_WR_REG(CAMx, CAM_DVP2AXI_FRAME_BCNT, cfg->frameSize);

    /* Clear interrupt */
    BL_WR_REG(CAMx, CAM_DVP_FRAME_FIFO_POP, 0xFFFF0);

#ifndef BFLB_USE_HAL_DRIVER
    Interrupt_Handler_Register(DVP2BUS_INT0_IRQn, CAM0_IRQHandler);
    Interrupt_Handler_Register(DVP2BUS_INT1_IRQn, CAM1_IRQHandler);
    Interrupt_Handler_Register(DVP2BUS_INT2_IRQn, CAM2_IRQHandler);
    Interrupt_Handler_Register(DVP2BUS_INT3_IRQn, CAM3_IRQHandler);
    Interrupt_Handler_Register(DVP2BUS_INT4_IRQn, CAM4_IRQHandler);
    Interrupt_Handler_Register(DVP2BUS_INT5_IRQn, CAM5_IRQHandler);
    Interrupt_Handler_Register(DVP2BUS_INT6_IRQn, CAM6_IRQHandler);
    Interrupt_Handler_Register(DVP2BUS_INT7_IRQn, CAM7_IRQHandler);
#endif
}

/****************************************************************************/ /**
 * @brief  Deinit camera module
 *
 * @param  camId: CAM ID type
 *
 * @return None
 *
*******************************************************************************/
void CAM_Deinit(CAM_ID_Type camId)
{
    switch(camId){
        case CAM0_ID:
            GLB_AHB_DSP_Software_Reset(GLB_AHB_DSP_SW_SWRST_DVP2BUSA);
            break;
        case CAM1_ID:
            GLB_AHB_DSP_Software_Reset(GLB_AHB_DSP_SW_SWRST_DVP2BUSB);
            break;
        case CAM2_ID:
            GLB_AHB_DSP_Software_Reset(GLB_AHB_DSP_SW_SWRST_DVP2BUSC);
            break;
        case CAM3_ID:
            GLB_AHB_DSP_Software_Reset(GLB_AHB_DSP_SW_SWRST_DVP2BUSD);
            break;
        case CAM4_ID:
            GLB_AHB_DSP_Software_Reset(GLB_AHB_DSP_SW_SWRST_DVP2BUSE);
            break;
        case CAM5_ID:
            GLB_AHB_DSP_Software_Reset(GLB_AHB_DSP_SW_SWRST_DVP2BUSF);
            break;
        case CAM6_ID:
            GLB_AHB_DSP_Software_Reset(GLB_AHB_DSP_SW_SWRST_DVP2BUSG);
            break;
        case CAM7_ID:
            GLB_AHB_DSP_Software_Reset(GLB_AHB_DSP_SW_SWRST_DVP2BUSH);
            break;
        default:
            break;
    }
}

/****************************************************************************/ /**
 * @brief  Enable camera module
 *
 * @param  camId: CAM ID type
 *
 * @return None
 *
*******************************************************************************/
void CAM_Enable(CAM_ID_Type camId)
{
    uint32_t tmpVal;
    uint32_t CAMx = camAddr[camId];

    /* Check the parameters */
    CHECK_PARAM(IS_CAM_ID_TYPE(camId));

    /* Enable camera module */
    tmpVal = BL_RD_REG(CAMx, CAM_DVP2AXI_CONFIGUE);
    tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_DVP_ENABLE);
    BL_WR_REG(CAMx, CAM_DVP2AXI_CONFIGUE, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Disable camera module
 *
 * @param  camId: CAM ID type
 *
 * @return None
 *
*******************************************************************************/
void CAM_Disable(CAM_ID_Type camId)
{
    uint32_t tmpVal;
    uint32_t CAMx = camAddr[camId];

    /* Check the parameters */
    CHECK_PARAM(IS_CAM_ID_TYPE(camId));

