RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_cam.c
    /* Disable camera module */
    tmpVal = BL_RD_REG(CAMx, CAM_DVP2AXI_CONFIGUE);
    tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_DVP_ENABLE);
    BL_WR_REG(CAMx, CAM_DVP2AXI_CONFIGUE, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Camera clock gate function
 *
 * @param  camId: CAM ID type
 * @param  enable: Enable or disable
 *
 * @return None
 *
*******************************************************************************/
void CAM_Clock_Gate(CAM_ID_Type camId, BL_Fun_Type enable)
{
    uint32_t tmpVal;
    uint32_t CAMx = camAddr[camId];

    /* Check the parameters */
    CHECK_PARAM(IS_CAM_ID_TYPE(camId));

    tmpVal = BL_RD_REG(CAMx, CAM_DVP2AXI_CONFIGUE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_DVP_PIX_CLK_CG, enable);
    BL_WR_REG(CAMx, CAM_DVP2AXI_CONFIGUE, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Camera hsync crop function
 *
 * @param  camId: CAM ID type
 * @param  start: Valid hsync start count
 * @param  end: Valid hsync end count
 *
 * @return None
 *
*******************************************************************************/
void CAM_Hsync_Crop(CAM_ID_Type camId, uint16_t start, uint16_t end)
{
    uint32_t CAMx = camAddr[camId];

    /* Check the parameters */
    CHECK_PARAM(IS_CAM_ID_TYPE(camId));

    BL_WR_REG(CAMx, CAM_DVP2AXI_HSYNC_CROP, (start << 16) + end);
}

/****************************************************************************/ /**
 * @brief  Camera vsync crop function
 *
 * @param  camId: CAM ID type
 * @param  start: Valid vsync start count
 * @param  end: Valid vsync end count
 *
 * @return None
 *
*******************************************************************************/
void CAM_Vsync_Crop(CAM_ID_Type camId, uint16_t start, uint16_t end)
{
    uint32_t CAMx = camAddr[camId];

    /* Check the parameters */
    CHECK_PARAM(IS_CAM_ID_TYPE(camId));

    BL_WR_REG(CAMx, CAM_DVP2AXI_VSYNC_CROP, (start << 16) + end);
}

/****************************************************************************/ /**
 * @brief  Camera set total valid pix count in a line function
 *
 * @param  camId: CAM ID type
 * @param  count: Count value
 *
 * @return None
 *
*******************************************************************************/
void CAM_Set_Hsync_Total_Count(CAM_ID_Type camId, uint16_t count)
{
    uint32_t tmpVal;
    uint32_t CAMx = camAddr[camId];

    /* Check the parameters */
    CHECK_PARAM(IS_CAM_ID_TYPE(camId));

    tmpVal = BL_RD_REG(CAMx, CAM_DVP2AXI_FRAM_EXM);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_TOTAL_HCNT, count);
    BL_WR_REG(CAMx, CAM_DVP2AXI_FRAM_EXM, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Camera set total valid line count in a frame function
 *
 * @param  camId: CAM ID type
 * @param  count: Count value
 *
 * @return None
 *
*******************************************************************************/
void CAM_Set_Vsync_Total_Count(CAM_ID_Type camId, uint16_t count)
{
    uint32_t tmpVal;
    uint32_t CAMx = camAddr[camId];

    /* Check the parameters */
    CHECK_PARAM(IS_CAM_ID_TYPE(camId));

    tmpVal = BL_RD_REG(CAMx, CAM_DVP2AXI_FRAM_EXM);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_TOTAL_VCNT, count);
    BL_WR_REG(CAMx, CAM_DVP2AXI_FRAM_EXM, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Get one camera frame
 *
 * @param  camId: CAM ID type
 * @param  info: Camera frame infomation pointer
 *
 * @return None
 *
*******************************************************************************/
void CAM_Get_Frame_Info(CAM_ID_Type camId, CAM_Frame_Info *info)
{
    uint32_t tmpVal;
    uint32_t CAMx = camAddr[camId];

    /* Check the parameters */
    CHECK_PARAM(IS_CAM_ID_TYPE(camId));

    tmpVal = BL_RD_REG(CAMx, CAM_DVP_STATUS_AND_ERROR);

    info->validFrames = BL_GET_REG_BITS_VAL(tmpVal, CAM_FRAME_VALID_CNT);
    info->curFrameId = BL_GET_REG_BITS_VAL(BL_RD_REG(CAMx, CAM_FRAME_ID_STS01), CAM_FRAME_ID_0);
    info->curFrameAddr = BL_RD_REG(CAMx, CAM_FRAME_START_ADDR0);
    info->curFrameBytes = BL_RD_REG(CAMx, CAM_DVP2AXI_FRAME_BCNT);
    info->status = tmpVal;
}

/****************************************************************************/ /**
 * @brief  Get available count of frames
 *
 * @param  camId: CAM ID type
 *
 * @return Frames count
 *
*******************************************************************************/
uint8_t CAM_Get_Frame_Count(CAM_ID_Type camId)
{
    uint32_t CAMx = camAddr[camId];

    /* Check the parameters */
    CHECK_PARAM(IS_CAM_ID_TYPE(camId));

    return BL_GET_REG_BITS_VAL(BL_RD_REG(CAMx, CAM_DVP_STATUS_AND_ERROR), CAM_FRAME_VALID_CNT);
}

/****************************************************************************/ /**
 * @brief  Pop one camera frame
 *
 * @param  camId: CAM ID type
 *
 * @return None
 *
*******************************************************************************/
void CAM_Pop_Frame(CAM_ID_Type camId)
{
    uint32_t CAMx = camAddr[camId];

    /* Check the parameters */
    CHECK_PARAM(IS_CAM_ID_TYPE(camId));

    /* Pop one frame */
    BL_WR_REG(CAMx, CAM_DVP_FRAME_FIFO_POP, 1);
}

/****************************************************************************/ /**
 * @brief  CAMERA Enable Disable Interrupt
 *
 * @param  camId: CAM ID type
 * @param  intType: CAMERA Interrupt Type
 * @param  intMask: Enable or Disable
 *
 * @return None
 *
*******************************************************************************/
void CAM_IntMask(CAM_ID_Type camId, CAM_INT_Type intType, BL_Mask_Type intMask)
{
    uint32_t tmpVal;
    uint32_t CAMx = camAddr[camId];

    /* Check the parameters */
    CHECK_PARAM(IS_CAM_ID_TYPE(camId));
    CHECK_PARAM(IS_CAM_INT_TYPE(intType));
    CHECK_PARAM(IS_BL_MASK_TYPE(intMask));

    tmpVal = BL_RD_REG(CAMx, CAM_DVP_STATUS_AND_ERROR);

    switch (intType) {
        case CAM_INT_NORMAL:
            if (intMask == UNMASK) {
                /* Enable this interrupt */
                tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_NORMAL_EN);
            } else {
                /* Disable this interrupt */
                tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_INT_NORMAL_EN);
            }

            break;

