RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_cam.c
        case CAM_INT_MEMORY_OVERWRITE:
            if (intMask == UNMASK) {
                /* Enable this interrupt */
                tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_MEM_EN);
            } else {
                /* Disable this interrupt */
                tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_INT_MEM_EN);
            }

            break;

        case CAM_INT_FRAME_OVERWRITE:
            if (intMask == UNMASK) {
                /* Enable this interrupt */
                tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_FRAME_EN);
            } else {
                /* Disable this interrupt */
                tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_INT_FRAME_EN);
            }

            break;

        case CAM_INT_FIFO_OVERWRITE:
            if (intMask == UNMASK) {
                /* Enable this interrupt */
                tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_FIFO_EN);
            } else {
                /* Disable this interrupt */
                tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_INT_FIFO_EN);
            }

            break;

        case CAM_INT_VSYNC_CNT_ERROR:
            if (intMask == UNMASK) {
                /* Enable this interrupt */
                tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_VCNT_EN);
            } else {
                /* Disable this interrupt */
                tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_INT_VCNT_EN);
            }

            break;

        case CAM_INT_HSYNC_CNT_ERROR:
            if (intMask == UNMASK) {
                /* Enable this interrupt */
                tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_HCNT_EN);
            } else {
                /* Disable this interrupt */
                tmpVal = BL_CLR_REG_BIT(tmpVal, CAM_REG_INT_HCNT_EN);
            }

            break;

        case CAM_INT_ALL:
            if (intMask == UNMASK) {
                /* Enable all interrupt */
                tmpVal |= 0xFC0;
            } else {
                /* Disable all interrupt */
                tmpVal &= 0xFFFFF03F;
            }

            break;

        default:
            break;
    }

    BL_WR_REG(CAMx, CAM_DVP_STATUS_AND_ERROR, tmpVal);
}

/****************************************************************************/ /**
 * @brief  CAMERA Interrupt Clear
 *
 * @param  camId: CAM ID type
 * @param  intType: CAMERA Interrupt Type
 *
 * @return None
 *
*******************************************************************************/
void CAM_IntClr(CAM_ID_Type camId, CAM_INT_Type intType)
{
    uint32_t tmpVal;
    uint32_t CAMx = camAddr[camId];

    /* Check the parameters */
    CHECK_PARAM(IS_CAM_ID_TYPE(camId));

    tmpVal = BL_RD_REG(CAMx, CAM_DVP_FRAME_FIFO_POP);

    switch (intType) {
        case CAM_INT_NORMAL:
            tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_NORMAL_CLR);
            break;

        case CAM_INT_MEMORY_OVERWRITE:
            tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_MEM_CLR);
            break;

        case CAM_INT_FRAME_OVERWRITE:
            tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_FRAME_CLR);
            break;

        case CAM_INT_FIFO_OVERWRITE:
            tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_FIFO_CLR);
            break;

        case CAM_INT_VSYNC_CNT_ERROR:
            tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_VCNT_CLR);
            break;

        case CAM_INT_HSYNC_CNT_ERROR:
            tmpVal = BL_SET_REG_BIT(tmpVal, CAM_REG_INT_HCNT_CLR);
            break;

        case CAM_INT_ALL:
            tmpVal = 0xFFFF0;

        default:
            break;
    }

    BL_WR_REG(CAMx, CAM_DVP_FRAME_FIFO_POP, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Install camera interrupt callback function
 *
 * @param  camId: CAM ID type
 * @param  intType: CAMERA interrupt type
 * @param  cbFun: Pointer to interrupt callback function. The type should be void (*fn)(void)
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void CAM_Int_Callback_Install(CAM_ID_Type camId, CAM_INT_Type intType, intCallback_Type *cbFun)
{
    /* Check the parameters */
    CHECK_PARAM(IS_CAM_ID_TYPE(camId));
    CHECK_PARAM(IS_CAM_INT_TYPE(intType));

    camIntCbfArra[camId][intType] = cbFun;
}
#endif

/****************************************************************************/ /**
 * @brief  CAMERA input 8-bit mode lower/upper byte select function
 *
 * @param  camId: CAM ID type
 * @param  byteType: Byte type
 *
 * @return None
 *
*******************************************************************************/
void CAM_8_Bit_Byte_Select(CAM_ID_Type camId, CAM_8_Bit_Byte_Type byteType)
{
    uint32_t tmpVal;
    uint32_t CAMx = camAddr[camId];

    /* Check the parameters */
    CHECK_PARAM(IS_CAM_ID_TYPE(camId));
    CHECK_PARAM(IS_CAM_8_BIT_BYTE_TYPE(byteType));

    tmpVal = BL_RD_REG(CAMx, CAM_DVP2AXI_CONFIGUE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_DVP_DATA_BSEL, byteType);
    BL_WR_REG(CAMx, CAM_DVP2AXI_CONFIGUE, tmpVal);
}

/****************************************************************************/ /**
 * @brief  CAMERA input 16-bit mode RGB order select function
 *
 * @param  camId: CAM ID type
 * @param  rgbType: RGB order type
 *
 * @return None
 *
*******************************************************************************/
void CAM_16_Bit_RGB_order(CAM_ID_Type camId, CAM_16_Bit_RGB_Type rgbType)
{
    uint32_t tmpVal;
    uint32_t CAMx = camAddr[camId];

    /* Check the parameters */
    CHECK_PARAM(IS_CAM_ID_TYPE(camId));
    CHECK_PARAM(IS_CAM_16_BIT_RGB_TYPE(rgbType));

    tmpVal = BL_RD_REG(CAMx, CAM_DVP2AXI_MISC);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_FORMAT_565, rgbType);
    BL_WR_REG(CAMx, CAM_DVP2AXI_MISC, tmpVal);
}

/****************************************************************************/ /**
 * @brief  CAMERA input 32-bit mode alpha value set function
 *
 * @param  camId: CAM ID type
 * @param  alpha: Alpha value
 *
 * @return None
 *
*******************************************************************************/
void CAM_32_Bit_Alpha_Set(CAM_ID_Type camId, uint8_t alpha)
{
    uint32_t tmpVal;
    uint32_t CAMx = camAddr[camId];

    /* Check the parameters */
    CHECK_PARAM(IS_CAM_ID_TYPE(camId));

    tmpVal = BL_RD_REG(CAMx, CAM_DVP2AXI_MISC);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_ALPHA, alpha);
    BL_WR_REG(CAMx, CAM_DVP2AXI_MISC, tmpVal);
}

/****************************************************************************/ /**
 * @brief  CAMERA set frame period and bitwise frame valid in period function
 *
 * @param  camId: CAM ID type
 * @param  period: Frame period count
 * @param  validBit: Bitwise frame valid in period
 *
 * @return None
 *
*******************************************************************************/
void CAM_Set_Frame_Valid_Period(CAM_ID_Type camId, uint8_t period, uint32_t validBit)
{
    uint32_t tmpVal;
    uint32_t CAMx = camAddr[camId];

    /* Check the parameters */
    CHECK_PARAM(IS_CAM_ID_TYPE(camId));

