RT-Thread/rt-thread/bsp/bl808/m0/libraries/platform/soc/bl808/bl808_e907_std/bl808_bsp_driver/std_drv/src/bl808_cam.c
    tmpVal = BL_RD_REG(CAMx, CAM_DVP2AXI_FRAME_PERIOD);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_FRAME_PERIOD, period);
    BL_WR_REG(CAMx, CAM_DVP2AXI_FRAME_PERIOD, tmpVal);

    BL_WR_REG(CAMx, CAM_DVP2AXI_FRAME_VLD, validBit);
}

/****************************************************************************/ /**
 * @brief  Enable or disable function that covers first frame memory everytime in hardware mode
 *
 * @param  camId: CAM ID type
 * @param  enable: Enable or disable
 *
 * @return None
 *
*******************************************************************************/
void CAM_HW_Cover_First_Frame_Everytime(CAM_ID_Type camId, BL_Fun_Type enable)
{
    uint32_t tmpVal;
    uint32_t CAMx = camAddr[camId];

    /* Check the parameters */
    CHECK_PARAM(IS_CAM_ID_TYPE(camId));

    tmpVal = BL_RD_REG(CAMx, CAM_DVP2AXI_CONFIGUE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, CAM_REG_HW_MODE_FWRAP, enable);
    BL_WR_REG(CAMx, CAM_DVP2AXI_CONFIGUE, tmpVal);
}

/****************************************************************************/ /**
 * @brief  Camera 0 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void CAM0_IRQHandler(void)
{
    CAM_IntHandler(CAM0_ID);
}
#endif

/****************************************************************************/ /**
 * @brief  Camera 1 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void CAM1_IRQHandler(void)
{
    CAM_IntHandler(CAM1_ID);
}
#endif

/****************************************************************************/ /**
 * @brief  Camera 2 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void CAM2_IRQHandler(void)
{
    CAM_IntHandler(CAM2_ID);
}
#endif

/****************************************************************************/ /**
 * @brief  Camera 3 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void CAM3_IRQHandler(void)
{
    CAM_IntHandler(CAM3_ID);
}
#endif

/****************************************************************************/ /**
 * @brief  Camera 4 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void CAM4_IRQHandler(void)
{
    CAM_IntHandler(CAM4_ID);
}
#endif

/****************************************************************************/ /**
 * @brief  Camera 5 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void CAM5_IRQHandler(void)
{
    CAM_IntHandler(CAM5_ID);
}
#endif

/****************************************************************************/ /**
 * @brief  Camera 6 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void CAM6_IRQHandler(void)
{
    CAM_IntHandler(CAM6_ID);
}
#endif

/****************************************************************************/ /**
 * @brief  Camera 7 interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void CAM7_IRQHandler(void)
{
    CAM_IntHandler(CAM7_ID);
}
#endif

/*@} end of group CAM_Public_Functions */

/*@} end of group CAM */

/*@} end of group BL808_Peripheral_Driver */
